{
  "architectures": [
    "Qwen2_5_VLForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "image_token_id": 151655,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 128000,
  "max_window_layers": 70,
  "model_type": "multiway_qwen2_5_vl",
  "multiway_config": {
    "hidden_size": 2048,
    "fusion_layer_config": {
      "attn_config": {
        "attn_drop": 0.1,
        "c_kv_dim": 256,
        "c_q_dim": 128,
        "hidden_size": 2048,
        "model_type": "MultiheadLatentAttention",
        "nope_qk_head_dim": null,
        "nope_v_head_dim": null,
        "num_heads": 16,
        "return_dict": true,
        "rms_norm_eps": 1e-06,
        "rope_head_dim": 64,
        "scaling": null,
        "use_flash_attn": false,
        "use_torch_sdpa": false
      },
      "drop_path": 0.1,
      "hidden_size": 2048,
      "model_type": "TransformerLayer",
      "moe_config": {
        "act_fn": null,
        "bias": true,
        "drop_out": 0.1,
        "alpha": 1e-05,
        "gamma": 1e-04,
        "hidden_size": 2048,
        "model_type": "DeepSeekMoE",
        "num_routed_experts": 15,
        "num_shared_experts": 1,
        "routed_expert_intermediate_size": null,
        "shared_expert_intermediate_size": null,
        "top_k": 3,
        "top_p": 1.0
      },
      "norm": null,
      "rms_norm_eps": 1e-06
    },
    "model_type": "Multiway",
    "multiway_layer_config": {
      "drop_path": 0.1,
      "hidden_size": 2048,
      "model_type": "MultiwayLayer",
      "norm": null,
      "num_routed_modalities": 2,
      "num_shared_modalities": 0, 
      "rms_norm_eps": 1e-06,
      "attn_config": {
        "attn_drop": 0.1,
        "c_kv_dim": 256,
        "c_q_dim": 128,
        "hidden_size": 2048,
        "model_type": "MultiheadLatentAttention",
        "nope_qk_head_dim": null,
        "nope_v_head_dim": null,
        "num_heads": 16,
        "return_dict": true,
        "rms_norm_eps": 1e-06,
        "rope_head_dim": 64,
        "scaling": null,
        "use_flash_attn": false,
        "use_torch_sdpa": false
      },
      "routed_moe_config": {
        "act_fn": null,
        "alpha": 1e-05,
        "bias": true,
        "drop_out": 0.1,
        "gamma": 1e-04,
        "hidden_size": 2048,
        "model_type": "DeepSeekMoE",
        "num_routed_experts": 7,
        "num_shared_experts": 1,
        "routed_expert_intermediate_size": null,
        "shared_expert_intermediate_size": null,
        "top_k": 3,
        "top_p": 1.0
      },
      "shared_moe_config": {
        "act_fn": null,
        "alpha": 1e-05,
        "bias": true,
        "drop_out": 0.1,
        "gamma": 1e-04,
        "hidden_size": 2048,
        "model_type": "DeepSeekMoE",
        "num_routed_experts": 15,
        "num_shared_experts": 1,
        "routed_expert_intermediate_size": null,
        "shared_expert_intermediate_size": null,
        "top_k": 3,
        "top_p": 1.0
      }
    },
    "norm": null,
    "num_fusion_layers": 2,
    "num_multiway_layers": 4,
    "rms_norm_eps": 1e-06
  },
  "num_attention_heads": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_head_dim": 64,
  "rope_head_section": [8, 12, 12],
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.50.0",
  "use_cache": true,
  "use_sliding_window": false,
  "video_token_id": 151656,
  "vision_config": {
    "depth": 32,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "in_channels": 3,
    "in_chans": 3,
    "intermediate_size": 3420,
    "model_type": "qwen2_5_vl",
    "num_heads": 16,
    "out_hidden_size": 2048,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "temporal_patch_size": 2,
    "tokens_per_second": 2,
    "window_size": 112
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vision_token_id": 151654,
  "vocab_size": 151936
}
